app/controllers/users_controller.rb

  def create
     @user = User.new
     @user.username = params["username"]
     @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "bab"], ["created_at", "2018-07-31 15:18:27.527377"], ["updated_at", "2018-07-31 15:18:27.527377"]]